Tekla Open API Reference for Tekla Structures 2025
CustomPartBase.CustomPartPositioningType Enumeration
 Defines the type of the positioning.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum CustomPartPositioningType
Public Enumeration CustomPartPositioningType
Members
Member name | Value | Description
POSITIONING_BY_CENTER_OF_BOUNDING_BOX | 1 |  Positioning happens based on total extrema of objects. Default value. Same as "Use center of the bounding box in positioning" value on in custom component wizard
POSITIONING_BY_INPUTPOINTS | 2 |  Positioning happens based on input points and extrema of objects. Similar to exact positioning in custom parts Same as "Use center of the bounding box in positioning" value off in custom component wizard
See Also
Reference
Tekla.Structures.Plugins Namespace